{
  "416329": "When you welcome our crewinto your home, we do not take it for granted. Every moment spent on your property will be dedicated to maximizing the cleanliness of your home. With the quality of our house cleaning and maid services, you will rest in your home with an added peace of mind that your environment is clean as can be. Give us a call today or request a quote!",
  "7c61103a": "Call Now: ",
  "-2b7c89a7": "(360) 970-7504",
  "-177e2c38": "Free Quote",
  "1449b50f": "Commercial Cleaning",
  "5ec134e4": "Janitorial Service",
  "107de87f": "Disinfecting Services",
  "28f04e2e": "Medical Office Cleaning",
  "-442535b1": "Dental Office Cleaning",
  "-7bf720d7": "Window Cleaning",
  "-3883192b": "Residential Cleaning",
  "74989e39": "House Cleaning",
  "-423e6e53": "Deep Cleaning",
  "2e1d8608": "Pressure Washing",
  "7b3ec11f": "Book Now",
  "-49e13446": "Schedule Your Personalized Cleaning Service",
  "7965680f": "Janitorial Services",
  "-65ee1e23": "Office Cleaning",
  "595f91e0": "Facility Management",
  "-53853619": "Medical Facility Cleaning",
  "20e5100": "Move-In/Move-Out",
  "4d373af": "Maid Services",
  "-27de7ff8": "Post Construction Cleaning",
  "79f79ac1": "Disinfecting & Sanitizing",
  "-64104400": "Contact",
  "-687c1ec": "Call Now",
  "3137a5e2": "Email Us",
  "-2dbf84f7": "Copyright © 2021 Squeaky Kleen. All rights reserved.",
  "-565b873": "House Cleaning & Maid Services for Wenatchee, WA",
  "1f30771a": "No job is too small for our crew. We are honored to be welcomed into your home.",
  "-1f1bc2ce": "Professional House Cleaning",
  "2b44f07e": "Disinfecting Services for Wenatchee, WA",
  "-255024e0": "Is your home or business in need of complete sanitization? Call Squeaky Kleen..",
  "-2c35064a": "Has the safety of your home or office recently been threatened by a customer or staff-member with COVID? Or maybe you'd like to simply rest assured your environment is completely safe? You found the right team to settle your concerns. Call Squeaky Kleen.",
  "-23f89826": "Ever since the outbreak of COVID, our crew has been on call, ready to serve the people of Wenatchee by doing our part to prevent the spread. You can count on our crew to be immediately responsive, and attentive to the situation. All cases are treated with complete care and professionalism. We will get your business back up and running, or your family back in the home. ",
  "36f6151": "Janitorial Services & Office Cleaning for Wenatchee, WA",
  "7401269e": "Depend on Squeaky Kleen to maintain the cleanliness of your workspace.",
  "4a933cb6": "Professional Janitorial Services",
  "-2429c002": "Our expert crew has many years of experience in providing office general office cleaning and janitorial services. Compare our work with anyone! Our quality of service is excellent, and attention to detail is unmatched. Try our services once, and we will strive to secure your business for life. We have been acknowledged for the friendliness of our staff, as well as for our willingness to go above and beyond. Contact us today! We'll be happy you called.",
  "-65c3ef2c": "Has the safety of your business or workspace recently been threatened by a patient or staff-member with COVID? Ask us about our ",
  "-3c3b55b2": "Disinfecting and Sanitizing services",
  "2e": ".",
  "-631215d4": "Deep Cleaning for Wenatchee, WA",
  "5c372e89": "Moving In? Moving Out? Need Post Construction Clean up?",
  "65fe6439": "Move-In/Move-Out Cleaning",
  "31e7c816": "Are you looking make your new home spotless? Or maybe you'd like to clean hour home before your next tenants move in? Give us a call! We'll be sure to clear every nook and cranny of any dirt or grime. We'll leave your home in tip-top shape. ",
  "200d": "‍",
  "-70c7697d": "If you have just finished a remodeling project in your home or office, or you are a general contractor who dreads the post-construction mess, give Squeaky Kleen a call to clean up for you. We will reveal your kitchen after a swift and complete clean up.",
  "-4d14bdb1": "Providing Olympia with Professional Residential & Commercial Cleaning Services",
  "419e46f7": "Maintaining the cleanliness of your home & business. Call today to request a free quote!",
  "-36431f91": "Commercial Cleaning Services",
  "32aeb3d9": "Air BnB Cleaning",
  "-a1b297": "Residential Cleaning Services",
  "1c98e051": "Post Construction",
  "645efc51": "About Us",
  "d8b794a": "When you hire Squeaky Kleen, our crew goes to work with pride and gratitude for your business. Whether you have a multi-bedroom home that needs tidied up, or an office workspace that needs regular maintenance, our team is ready for the job! ",
  "770367bf": "Squeaky Kleen provides cleaning and disinfecting services to homes and offices throughout Wenatchee and the surrounding areas. We understand the importance of maintaining the cleanliness of your home or business, especially in the times that we are in today. We carefully clean and clear every corner of each room to ensure that no spot is left untouched. Our goal is to sanitize and disinfect every surface, while leaving the inside of your property nice and neat, so that you may relax with added peace in mind that you are in a clean environment. After years in the industry, we know that we can please any customer that comes our way. Our rates are affordable, and our service is excellent. We complete projects efficiently and on schedule, and go above and beyond to form lasting relationships with our clients. Give us a call today or request a free quote!",
  "-3a003184": "Air BnB Housekeeping for Wenatchee, WA",
  "50332f21": "Air BnB homes always require a higher standard of cleanliness. Our experts know.",
  "1efc54e": "Air BnB Cleaning Service",
  "3b14af5d": "At  Squeaky Kleen, we understand that Air BnB's have different guests coming and going all month that may need cleaned after. Especially nowadays! This is why it should be incredibly important to maintain the cleanliness of your residence. Our crew will strive to sanitize each and every surface, without missing a single spot. When we accept any job, we know that our service must be perfect. Perfection is what we strive to deliver.",
  "-64fa952b": "Has your residence been occupied by a guest with COVID? Ask us about our ",
  "-c0d871": "Disinfecting Services."
}